{
    "status": true,
    "data": {
        "sections": [
            {
                "id": "dfjkh34t5lj23hl3kj5h34lk5j3",
                "parent": "3g26jkh4562gj234523k4j523",
                "published": true,
                "type": "text"
            },
            {
                "id": "kj2hg323532kj5h343k252h34gkj",
                "parent": "3g26jkh4562gj234523k4j523",
                "published": false,
                "type": "quote"
            },
            {
                "id": "lk2h34l5kj345h6l3456453l",
                "parent": "3g26jkh4562gj234523k4j523",
                "published": true,
                "type": "gallery"
            }
        ],
        "html": "<!DOCTYPE html>\n<html dir=\"ltr\">\n<head>\n    <meta charset=\"utf-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\"/>\n\n    <title></title>\n\n    <!-- Website style css -->\n    <link rel=\"stylesheet\" href=\"/assets/stylesheets/example-page-visual-editor.css\" />\n\n    <!-- CMS specific styles needed to display content correctly -->\n    <link rel=\"stylesheet\" href=\"/assets/stylesheets/page-visual-editor-inject.css\" />\n</head>\n<body>\n\n    <div class=\"cms-section-list\" data-id=\"3g26jkh4562gj234523k4j523\">\n        <div class=\"cms-section-item\" data-id=\"dfjkh34t5lj23hl3kj5h34lk5j3\">\n\n            <div class=\"container accordion-component\">\n                <h2>Pariatur dolor pariatur nisi officia</h2>\n                <ol>\n                    <li>Laboris in mollit labore cillum.</li>\n                    <li>Pariatur exercitation dolor ea consequat esse sunt.</li>\n                    <li>Laborum commodo commodo voluptate pariatur elit amet laboris mollit anim sunt ad incididunt.</li>\n                </ol>\n            </div>\n\n        </div>\n        <div class=\"cms-section-item\" data-id=\"kj2hg323532kj5h343k252h34gkj\">\n\n            <div class=\"quote-component\">\n                <figure></figure>\n                <p class=\"quote-component__text\">\n                    <span class=\"js-dynamic-test\">DYNAMIC CONTENT TEST.<br /> Anim adipisicing cupidatat elit minim. Reprehenderit nisi quis fugiat adipisicing duis ullamco. Ipsum laborum minim cupidatat anim amet sit qui ipsum cillum exercitation voluptate ea reprehenderit tempor. In mollit consectetur commodo dolor sint officia duis sint. Consequat minim velit amet mollit qui et sunt incididunt. Minim exercitation cillum qui elit sint duis consequat nulla culpa et dolore culpa do magna. Ex consequat consectetur elit quis exercitation magna enim eiusmod consectetur do eu tempor.</span>\n                    <span class=\"is-hidden js-dynamic-test\">DYNAMIC CONTENT TEST.<br /> Consectetur do nostrud commodo dolor dolor exercitation sint.</span>\n                    <span class=\"is-hidden js-dynamic-test\">DYNAMIC CONTENT TEST.<br /> Ex est cillum esse proident. Elit sint ea ut fugiat cupidatat eiusmod ad reprehenderit incididunt culpa Lorem. Incididunt consequat consectetur laboris elit sint ipsum sunt voluptate et nulla anim duis. Adipisicing est qui eiusmod laborum voluptate non consequat pariatur qui irure incididunt in. Aute cillum occaecat Lorem duis laboris et nostrud velit dolor quis Lorem. Reprehenderit nisi magna magna mollit laboris irure deserunt amet minim tempor labore. Nostrud sint esse ut exercitation aute nostrud occaecat quis mollit non irure nulla voluptate quis.</span>\n                    <span class=\"is-hidden js-dynamic-test\">DYNAMIC CONTENT TEST.<br /> Labore eiusmod anim adipisicing enim excepteur. Voluptate commodo eiusmod exercitation do. Eu veniam labore reprehenderit quis irure est amet. </span>\n                    <span class=\"is-hidden js-dynamic-test\">DYNAMIC CONTENT TEST.<br /> In labore proident duis sint deserunt dolore. Exercitation consequat proident mollit ex in quis elit anim magna ut consectetur. Lorem dolore aute consectetur excepteur. Occaecat velit qui nulla officia amet id esse esse et occaecat eu irure dolore et. Exercitation exercitation culpa deserunt ullamco duis ullamco incididunt ipsum. In aute ut nisi ex cupidatat excepteur proident incididunt velit nulla consequat incididunt ullamco reprehenderit. Exercitation veniam do dolore veniam veniam dolore.</span>\n                    <span class=\"is-hidden js-dynamic-test\">DYNAMIC CONTENT TEST.<br /> Velit sunt id qui culpa ea quis non. Consectetur minim officia irure elit excepteur consectetur. Ullamco quis voluptate qui aliquip cupidatat enim. </span>\n                </p>\n                <p class=\"quote-component__title\">Est aute elit sint<br /><small>Voluptate commodo</small></p>\n            </div>\n\n        </div>\n        <div class=\"cms-section-item\" data-id=\"lk2h34l5kj345h6l3456453l\">\n\n            <div class=\"container-large gallery-component\">\n                <h2>Esse Lorem nulla Lorem qui</h2>\n                <ul>\n                    <li>\n                        <p>Mollit nisi aliqua in cupidatat in ea duis Lorem eiusmod est cillum culpa elit.</p>\n                    </li>\n                    <li>\n                        <ol>\n                            <li><span>Commodo nisi voluptate proident ullamco consequat et velit ut velit.</span></li>\n                            <li><span>Commodo irure fugiat veniam qui exercitation fugiat non consectetur.</span></li>\n                            <li><span>Officia consectetur ad ex enim aliquip.</span></li>\n                        </ol>\n                        <p>Eu labore voluptate velit duis sit voluptate est do magna. Enim quis proident dolore incididunt voluptate sit laborum est enim sint sunt sunt. Culpa laboris enim veniam incididunt. Ex consequat voluptate reprehenderit nostrud ipsum consequat incididunt deserunt non laborum Lorem eiusmod voluptate. Cupidatat culpa amet fugiat Lorem minim eiusmod consectetur mollit. Sit culpa anim qui adipisicing Lorem.</p>\n                    </li>\n                </ul>\n            </div>\n\n        </div>\n    </div>\n\n    <script>    \n        var contents = document.querySelectorAll('.js-dynamic-test');\n        var index = 0;\n        setInterval(() => {\n            contents[index].classList.add('is-hidden');\n            index = (index + 1) % contents.length;\n            contents[index].classList.remove('is-hidden');\n        }, 2000)\n    </script>\n\n</body>\n</html>"
    }
}